---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRunExtendBelowTreadBase
source: html/a51b153a-b7fc-81f7-ef27-54a2767f4253.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRunExtendBelowTreadBase Property

"Extend Below Tread Base": Extend Below Tread Base

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRunExtendBelowTreadBase { get; }
```